tutorials/combustion/reactingFoam/RAS/chockedNozzle/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          T;
}

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 292;

boundaryField
{
    inletair
    {
        type            uniformFixedValue;
        uniformValue
        {
            type            csvFile;
            nHeaderLine     1;
            refColumn       0;
            componentColumns ( 2 );
            separator       ",";
            mergeSeparators no;
            file            "<constant>/inlet.csv";
        }
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 292;
        value           uniform 292;
    }
    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
